ruby/07-rails/copro/app/controllers/comments_controller.rb

	def create

		unless session[:user_id]
			redirect_to '/login'
			return
		end
		comment = Comment.new
		comment.title = params[:title]
		comment.body = params[:body]
		comment.user_id = params[:user_id]
		comment.project_id = params[:project_id]

		# raise "this is a stop point"

		if comment.save
---
INSERT INTO "comments" ("title", "body", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "123"], ["body", "456"], ["user_id", 3], ["project_id", 50], ["created_at", "2018-01-24 06:11:34.580068"], ["updated_at", "2018-01-24 06:11:34.580068"]]