ruby/07-rails/copro/app/controllers/likes_controller.rb

	def create
		redirect_to '/login' unless session[:user_id]
		like = Like.new
		like.user_id = session[:user_id]
		like.project_id = params[:project_id]
		# binding.pry
		if like.save
---
INSERT INTO "likes" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["project_id", 53], ["created_at", "2018-01-25 03:44:05.500549"], ["updated_at", "2018-01-25 03:44:05.500549"]]