ruby/07-rails/copro/app/controllers/pages_controller.rb

SELECT "projects".* FROM "projects"
---
	def home
		@projects = Project.all