ruby/07-rails/copro/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
	def show
		@project = Project.find_by(id:params[:id])

INSERT INTO "projects" ("title", "user_id", "created_at", "updated_at", "preview") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "456"], ["user_id", 3], ["created_at", "2018-01-24 01:41:59.328920"], ["updated_at", "2018-01-24 01:41:59.328920"], ["preview", "29.jpg"]]
---
	def create
		redirect_to '/login' unless session[:user_id]
		project = Project.new
		project.title = params[:title]
		project.user_id = session[:user_id]
		project.preview = params[:file]

		if project.save