ruby/07-rails/copro/app/controllers/session_controller.rb

	def create
		#check email
		user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hiby.90hou@qq.com"], ["LIMIT", 1]]