ruby/07-rails/copro/app/controllers/users_controller.rb

	def create
		#check email
		user = User.new
		user.name = params[:name]
		user.email = params[:email]
		user.password = params[:password]
		if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"