ruby/07-rails/goodfoodhunting/app/controllers/comments_controller.rb

	def api_create
		comment = Comment.new
		comment.content = params[:content]
		comment.dish_id = params[:dish_id]
		comment.save
---
INSERT INTO "comments" ("content", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "lunch"], ["dish_id", 2], ["created_at", "2018-02-01 02:03:11.882997"], ["updated_at", "2018-02-01 02:03:11.882997"]]