ruby/07-rails/goodfoodhunting/app/controllers/dishes_controller.rb

	def create
		dish = Dish.new
		dish.name = params[:name]
		dish.image_url = params[:image_url]
		dish.save
---
INSERT INTO "dishes" ("name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "123"], ["image_url", "345"], ["created_at", "2018-01-22 06:15:24.493776"], ["updated_at", "2018-01-22 06:15:24.493776"]]

	def show
		@dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def index
		@dish_list = Dish.all
---
SELECT "dishes".* FROM "dishes"

	def api_index
		@dish_list = Dish.all
---
SELECT "dishes".* FROM "dishes"

	def update
		dish = Dish.find(params[:id])
		dish.name = params[:name]
		dish.image_url = params[:image_url]
		dish.save
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "dishes" SET "name" = $1, "updated_at" = $2 WHERE "dishes"."id" = $3  [["name", "puddings"], ["updated_at", "2018-01-22 10:22:39.582787"], ["id", 1]]

	def destroy
		@dish = Dish.find(params[:id])
		if @dish.delete
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 2]]

	def edit
		@dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]