ruby/07-rails/copro/app/views/projects/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."project_id" = $1  [["project_id", 50]]
---
			<input type="hidden" name="project_id" value=<%= @project.id%>>
			<%= @project.likes.count %>